---
kind: other
id: Methods.T:Autodesk.Revit.DB.Electrical.InsulationType
source: html/014b028d-7ade-6ee6-044b-c3c1a754c96b.htm
---
# InsulationType Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.